const dataItems = [
    {id: 1, title: 'نص لوريم إيبسوم القياسي والمستخدم 1', description: 'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار.'},
    {id: 2, title: 'نص لوريم إيبسوم القياسي والمستخدم 2', description: 'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار.'},
    {id: 3, title: 'نص لوريم إيبسوم القياسي والمستخدم 3', description: 'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار.'},
    {id: 4, title: 'نص لوريم إيبسوم القياسي والمستخدم 4', description: 'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار.'},
    {id: 5, title: 'نص لوريم إيبسوم القياسي والمستخدم 5', description: 'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار.'},
    {id: 6, title: 'نص لوريم إيبسوم القياسي والمستخدم 6', description: 'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار.'},
    {id: 7, title: 'نص لوريم إيبسوم القياسي والمستخدم 7', description: 'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار.'},
    {id: 8, title: 'نص لوريم إيبسوم القياسي والمستخدم 8', description: 'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار.'},
    {id: 9, title: 'نص لوريم إيبسوم القياسي والمستخدم 9', description: 'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار.'},
    {id: 10, title: 'نص لوريم إيبسوم القياسي والمستخدم 10', description: 'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار.'}
];


$(document).ready(function() {
    $('#pagination-container').pagination({
        dataSource: dataItems,
        pageSize: 4,
        pageNumber: 1,
         callback: function(data, pagination) {
            let dataTemplate = _.template($('#services-template').html());
            let resultingHTML = dataTemplate({items : data});
            $('.individual-services .row').html(resultingHTML);
        }
    });
});